'''
    작성일 : 2023년 09월 27일
    작성자 : 202395930 컴퓨터공학부 정성욱
    설명 :  반복문 for 사용하기
'''

#본인 이름 5개 출력하기
print(":: 내 이름 5개 출력하기 ::")
for i in range (5) :
    print(i, ": 정성욱")
    
print(":: 내 이름 5개 출력하기 ::")
for i in [1,2,3,4,5] : #리스트
    print(i, ": 정성욱")
    
print(":: 리스트로 구구단을 19단 출력 ::")
for num in [1,2,3,4,5,6,7,8,9] : #range (1,10)
    print(f"19 x {num} = {19 * num}")
    
print(":: 문자열 내용 출력. ::")
for i in "Hello" :
    print("i = ",i)
    
#도전 문제 5.3
print("::: BTS 맴머 명단 출력 :::")
bts = ['뷔', '제이홈', '알엠', '정국', '진', '지민', '슈가'] #0번지 부터 시작
for i in bts :
    print(i)