'''
    작성일 : 2023년 10월 04일
    작성자 : 202395930 컴퓨터공학부 정성욱
    설명 : 더하기 암산 문제 만들기
            2개의 수로 더하기 결과를 맞추는 게임.
            2개의 수는 1 ~ 100 사이 랜덤으로 출제 됨.
            사용자가 0을 입력하면 프로그램은 종료.
            즉, 사용자가 0을 입력하기 전까지는 무한 반복하여 문제 풀기
            정답을 맞추면 "참 잘했어요 ! "
            틀리면 정답을 알려주고, "정답은 00 입니다. 틀렸습니다." 출력
            게임이 종료되면 "프로그램 종료 ! " 출력
            
            문제분석 : num1 과 num2 에 랜덤수를 생성하여 식을 만든후
                        사용자에게 정답을 입력받는데 
                        0을 입력받으면 프로그램 종료
                        
            알고리즘 : 1. 랜덤함수로 num1 과 num2에 숫자를 넣는다.
                        2. 랜덤수로 식을 만들어서 사용자에게 보여준다.
                        3. 사용자에게 정답을 입력받는다.
                        3-2. 단 정답을 0으로 입력받는다면 프로그램을 종료시킨다.
                        4. 정답을 입력받고 맞다면 "참 잘했어요 !" 출력
                        4-2. 정답을 입력받고 틀리다면 "정답은 00 입니다. 틀렸습니다." 을 출력
'''

import random #랜덤 함수를 사용


while True :
    num1 = random.randrange(1, 100) #num1 이라는 변수에 1 ~ 100 사이의 정수를 대입
    num2 = random.randrange(1, 100) #num2 이라는 변수에 1 ~ 100 사이의 정수를 대입
    
    print(num1, "+", num2, "=", end ='') #랜덤하게 나온 변수를 이용해 문제는 제공
    
    sum = int(input()) #답을 입력한다.
    
    if sum == 0 : #프로그램 종료 조건
        print("프로그램 종료 !")
        break
    
    if sum == num1 + num2 : #정답일시 출력되는 조건
        print("참 잘했어요 !")
        
    else : #정답이 아닐시 출력되는 조건
        print(f"정답은", num1+num2, "입니다. 틀렸습니다.")
        
    